// напишите программу, которая принимает на вход
// трехзачное число и на выходе показывает вторую цифру этого числа
// будм считать, что вторую слева, хоты для трехзначного числа это равносильно
// второму срава)
Console.Write("Введите трехзначное натуральое число: ");
int i= Convert.ToInt32(Console.Read());
Console.Write($"Введено число: {i}");
